zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_hsem.h
/**
  * @brief  Configure Group CID filtering.
  * @rmtoll G0CIDCFGR         ISEM          LL_HSEM_Config_Group_CID_Filtering
  * @param  HSEMx HSEM Instance.
  * @param  GroupId This parameter can be a combination of the following values:
  *         @arg Group  : 0
  *         @arg Group  : 1
  *         @arg Group  : 2
  *         @arg Group  : 3
  * @param  wlist This parameter can be a combination of the following values:
  *         @arg HSEM_COREID_CPU1 whitelist         : 1
  *         @arg HSEM_COREID_CPU2 whitelist         : 2
  *         @arg HSEM_COREID_CPU3 whitelist         : 4
  *         @arg HSEM_COREID_CPU1 & CPU2 whitelist  : 3
  *         @arg HSEM_COREID_CPU1 & CPU3 whitelist  : 5
  *         @arg HSEM_COREID_CPU2 & CPU3 whitelist  : 6
  *         @arg HSEM_CORE All whitelist            : 7
  *         @arg HSEM_CORE All blacklist            : 0
  * @retval None
  */
__STATIC_INLINE void LL_HSEM_Config_Group_CID_Filtering(HSEM_TypeDef *HSEMx, uint32_t GroupId, uint32_t wlist)
{
  __IO uint32_t *regaddr = ((uint32_t *)(&HSEMx->G0CIDCFGR)) + GroupId;
  WRITE_REG(*regaddr, ((wlist << HSEM_G0CIDCFGR_SEM_WLIST_C_Pos) | (HSEM_G0CIDCFGR_CFEN)));
}

/**
  * @brief  Disable Processor CID filtering.
  * @rmtoll C1CIDCFGR         ISEM          LL_HSEM_Disable_Processor_CID_Filtering
  * @param  HSEMx HSEM Instance.
  * @param  ProcessorCID This parameter can be a combination of the following values:
  *         @arg ProcessorCID  : 1
  *         @arg ProcessorCID  : 2
  *         @arg ProcessorCID  : 3
  * @retval None
  */
__STATIC_INLINE void LL_HSEM_Disable_Processor_CID_Filtering(HSEM_TypeDef *HSEMx, uint32_t ProcessorCID)
{
  __IO uint32_t *regaddr = ((uint32_t *)(&HSEMx->C1CIDCFGR)) + (ProcessorCID - 1U);
  CLEAR_BIT(*regaddr, HSEM_C1CIDCFGR_CFEN);
}

/**
  * @brief  Configure Group CID filtering.
  * @rmtoll C1CIDCFGR         ISEM          LL_HSEM_Config_Processor_CID_Filtering
  * @param  HSEMx HSEM Instance.
  * @param  CID This parameter can be a combination of the following values:
  *         @arg CID  : 1
  *         @arg CID  : 2
  *         @arg CID  : 3
  * @param  CIDDomainId Value between Min_Data=0 and Max_Data=7
  * @retval None
  */
__STATIC_INLINE void LL_HSEM_Config_Processor_CID_Filtering(HSEM_TypeDef *HSEMx, uint32_t CID, uint32_t CIDDomainId)
{
  __IO uint32_t *regaddr = ((uint32_t *)(&HSEMx->C1CIDCFGR)) + (CID - 1U);
  WRITE_REG(*regaddr, ((CIDDomainId << HSEM_C1CIDCFGR_CID_Pos) | (HSEM_C1CIDCFGR_CFEN)));
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(HSEM) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32MP2xx_LL_HSEM_H */
